content/posts/20210609140653-meditations_on_moloch.md
+++
title = "Meditations On Moloch"
author = ["Daniel Biasiotto"]
tags = ["essay"]
draft = false
+++

-   Source: <https://slatestarcodex.com/2014/07/30/meditations-on-moloch/>
-   Author: [Scott Alexander]({{< relref "20210609140844-scott_alexander.md" >}})
-   Tags: [Capitalism]({{< relref "20210609150106-capitalism.md" >}}), [Philosophy]({{< relref "20210609150135-philosophy.md" >}})


## Summary {#summary}

-   Moloch in the [Allen Ginsberg]({{< relref "20210609141205-allen_ginsberg.md" >}}) poem
    -   reply to [C.S. Lewis]({{< relref "20210609143301-c_s_lewis.md" >}})
-   the Malthusian trap
-   Scott makes the case the poem is not talking directly of Capitalism, it is instead referring to the human condition inside a Capitalistic System
    -   like rats the  capitalists have to abandon their value if they want to survive, to be fit [evolutionary parallel]
-   These scenarios [examples in the essay] are in fact a race to the bottom. Once one agent learns how to become more competitive by sacrificing a common value, all its competitors must also sacrifice that value or be outcompeted and replaced by the less scrupulous. Therefore, the system is likely to end up with everyone once again equally competitive, but the sacrificed value is gone forever.

These multipolar traps are united by one principle:

> In some competition optimizing for X, the opportunity arises to throw some other value under the bus for improved X. Those who take it prosper. Those who don’t take it die out. Eventually, everyone’s relative status is about the same as before, but everyone’s absolute status is worse than before. The process continues until all other values that can be traded off have been – in other words, until human ingenuity cannot possibly figure out a way to make things any worse. [$cit]({{< relref "20210604132601-cit.md" >}})

-   [Apocrypha Discordia]({{< relref "20210609151338-apocrypha_discordia.md" >}})
